# Zephyr
# https://github.com/mattmc3/zephyr/blob/main/plugins/directory/directory.plugin.zsh
mattmc3/zephyr path:plugins/completion
# mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/environment
# mattmc3/zephyr path:plugins/terminal  # no longer exists
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/color
# mattmc3/zephyr path:plugins/confd

# OMZ plugins
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
# ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/bgnotify
ohmyzsh/ohmyzsh path:plugins/archlinux
ohmyzsh/ohmyzsh path:plugins/python
# ohmyzsh/ohmyzsh path:plugins/poetry


# zsh-utils
belak/zsh-utils path:utility
belak/zsh-utils path:history
## belak/zsh-utils path:prompt

# prompt plugins
romkatv/powerlevel10k

# general plugins
# agkozak/zsh-z

# completion plugins
zsh-users/zsh-completions path:src kind:fpath
ohmyzsh/ohmyzsh path:plugins/gitfast
# TODO: troubleshoot missing descriptions in terraform autocomplete
# https://github.com/ohmyzsh/ohmyzsh/blob/master/plugins/terraform/_terraform
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/git

jeffreytse/zsh-vi-mode

# utilities
romkatv/zsh-bench kind:path

# load after populating fpath with other completion plugins
belak/zsh-utils path:completion

# deferred plugins
# djui/alias-tips kind:defer
MichaelAquilina/zsh-you-should-use kind:defer
zsh-users/zsh-autosuggestions kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
# zsh-users/zsh-history-substring-search kind:defer

# Code stats, set environment variable:
# CODESTATS_API_KEY with .zshenv
https://gitlab.com/code-stats/code-stats-zsh

# vim: ft=zsh sw=2 ts=2 et
